app/controllers/alunos_controller.rb

SELECT "alunos".* FROM "alunos"
---
  def index
    @alunos = Aluno.all

SELECT  "alunos".* FROM "alunos" WHERE "alunos"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @aluno = Aluno.find(params[:id])

INSERT INTO "alunos" ("login", "email", "password_digest", "nome", "cpf", "fone1", "fone2", "logradouro", "cidade", "uf", "cep", "escola", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @aluno = Aluno.new(aluno_params)

    respond_to do |format|
      if @aluno.save

UPDATE "alunos" SET "password_digest" = ?, "updated_at" = ? WHERE "alunos"."id" = ?  [["password_digest", "$2a$10$pJVNuBWxKguDP1XoX3PysugH1KfiGXtDVhRwfKNqhKUWD6APGz/HC"], ["updated_at", "2015-06-28 18:33:31.122377"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @aluno.update(aluno_params)

SELECT  "alunos".* FROM "alunos" WHERE "alunos"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_aluno
      @aluno = Aluno.find(params[:id])