app/controllers/permissaoacessos_controller.rb

SELECT "permissaoacessos".* FROM "permissaoacessos"
---
  def index
    @permissaoacessos = Permissaoacesso.all

INSERT INTO "permissaoacessos" ("descricao", "created_at", "updated_at") VALUES (?, ?, ?)  [["descricao", "permissao 1"], ["created_at", "2015-06-19 14:14:13.987254"], ["updated_at", "2015-06-19 14:14:13.987254"]]
---
  def create
    @permissaoacesso = Permissaoacesso.new(permissaoacesso_params)

    respond_to do |format|
      if @permissaoacesso.save

UPDATE "permissaoacessos" SET "descricao" = ?, "updated_at" = ? WHERE "permissaoacessos"."id" = ?  [["descricao", "permissao 1"], ["updated_at", "2015-06-19 14:52:53.657974"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @permissaoacesso.update(permissaoacesso_params)

SELECT  "permissaoacessos".* FROM "permissaoacessos" WHERE "permissaoacessos"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_permissaoacesso
      @permissaoacesso = Permissaoacesso.find(params[:id])