app/controllers/professors_controller.rb

INSERT INTO "professors" ("login", "email", "senha", "nome", "cpf", "fone1", "fone2", "logradouro", "cidade", "uf", "cep", "valorHoraAula", "qtdvotos", "qtdpontos", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @professor = Professor.new(professor_params)

    respond_to do |format|
      if @professor.save

UPDATE "professors" SET "email" = ?, "password_digest" = ?, "cpf" = ?, "fone1" = ?, "updated_at" = ? WHERE "professors"."id" = ?
---
  def update
    respond_to do |format|
      if @professor.update(professor_params)