app/controllers/sessions_controller.rb

  def create
    #logger.debug "tipo_acesso---->: #{ params[:session][:tipo_acesso].upcase}"
    #logger.debug "login---->: #{params[:session][:login]}"
    #logger.debug "senha---->: #{ params[:session][:password]}"


    # recupero o tipo de acesso informado para realizar
    # a busca na tabela correta(Aluno ou professor)
    @tipoAcesso = params[:session][:tipo_acesso].upcase

    if @tipoAcesso === 'A'
      @user = Aluno.find_by(login: params[:session][:login].downcase)
    else
      @user = Professor.find_by(login: params[:session][:login].downcase)
---
SELECT  "alunos".* FROM "alunos" WHERE "alunos"."login" = ? LIMIT 1  [["login", "aluno1"]]
SELECT  "professors".* FROM "professors" WHERE "professors"."login" = ? LIMIT 1  [["login", "aluno1"]]